JimInCA/mek6802d5-cassette-interface/workspace/mek6802d5_loader/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB16 (number 62), U7[4]/UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA1 (number 35), J1[8]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SCOPE_TRIGGER_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SCOPE_TRIGGER_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SCOPE_TRIGGER_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SCOPE_TRIGGER_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_SCOPE_TRIGGER_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB18 (number 64), J1[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_CMP0_UART_TX_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_CMP0_UART_TX_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_CMP0_UART_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_CMP0_UART_TX_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_CMP0_UART_TX_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC5 (number 77), J1[15]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CMP0_OUT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_CMP0_OUT_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_CMP0_OUT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC7 (number 79), J1[13]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_CMP0_IN1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_CMP0_IN1_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_CMP0_IN1_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
